const { Telegraf, Markup } = require('telegraf');

// Встав свій токен бота
const bot = new Telegraf('7390540523:AAEvUkQBdi5h_8oqKptlI4zkaHOAux364tw');
const WEBHOOK_URL = 'https://bot-a1zm.onrender.com';
const orderReturnState = new Set();

// Відповіді на типові питання
const responses = {
    "Години роботи кур'єрів": "Наші кур'єри працюють з 8:00 до 22:00 без вихідних.",
    "Як я можу зробити замовлення?": "Щоб зробити замовлення, просто виберіть страви з меню та додайте їх до кошика. Потім перейдіть до оформлення замовлення, вказавши вашу адресу та спосіб оплати.",
    "Які способи оплати доступні": "Ви можете оплатити замовлення готівкою при отриманні або через онлайн-оплату карткою на сайті.",
    "Як я можу змінити своє замовлення?": " Ви можете змінити або скасувати замовлення до моменту, коли воно буде оброблене. Для цього зв'яжіться з нашою службою підтримки.",
    "Чи є у вас знижки або акції?": "Так, ми регулярно проводимо акції та пропонуємо знижки. Перевірте наші актуальні пропозиції на сайті",
    "Що робити, якщо я отримав неправильне замовлення?": "Якщо ваше замовлення не відповідає тому, що ви замовляли, будь ласка, зв'яжіться з нашою службою підтримки, і ми виправимо ситуацію.",
    "Як отримати знижку на перше замовлення?": "Для нових клієнтів ми надаємо знижку 10% на перше замовлення. Використовуйте промокод, який ви отримаєте при реєстрації."
};

// Команда /start
bot.start((ctx) => {
    const userName = ctx.from.first_name || ctx.from.username || 'користувач';
    ctx.reply(`Вітаємо, ${userName} у чат-боті служби доставки! Оберіть запитання:`, {
        reply_markup: {
            keyboard: [["Вартість доставки"],
            ["Години роботи кур'єрів"],
            ["Що є в меню?"],
            ["Оформити повернення"],
            ["Які способи оплати доступні"],
            ["Як я можу змінити своє замовлення?"],
            ["Чи є у вас знижки або акції?"],
            ["Що робити, якщо я отримав неправильне замовлення?"],
            ["Як отримати знижку на перше замовлення?"]],
            resize_keyboard: true
        }
    });
});

const deliveryCosts = {
    'Центр': 30,
    'Оболонь': 40,
    'Троєщина': 60,
    'Дарниця': 55,
    'Позняки': 55,
    'Солом\'янка': 45,
    'Голосієво': 50,
    'Святошин': 45,
    'Печерськ': 35,
    'Шевченківський': 40,
    'Поділ': 40,
    'Відрадний': 50,
    'Совки': 50,
    'Борщагівка': 55,
    'Куренівка': 45,
};

const menu = {
    "Піца": 250,
    "Бургери": 200,
    "Паста": 150,
    "Салати": 120,
}

bot.hears(Object.keys(responses), (ctx) => {
    ctx.reply(responses[ctx.message.text]);
});



bot.hears('Вартість доставки', (ctx) => {
    ctx.reply('Виберіть ваш район:', Markup.keyboard(Object.keys(deliveryCosts), { columns: 3 }).oneTime().resize());
});
bot.hears('Що є в меню?', (ctx) => {
    ctx.reply('Виберіть позиції, що цікавлять:', Markup.keyboard(Object.keys(menu), { columns: 3 }).oneTime().resize());
});

bot.hears("Оформити повернення", (ctx) => {
        ctx.reply('Введіть номер замовлення:');
        orderReturnState.add(ctx.chat.id)
});

bot.on('text', (ctx) => {
    const district = ctx.message.text;
    const dishes = ctx.message.text;
    if (deliveryCosts[district]) {
        ctx.reply(`Вартість доставки в район ${district}: ${deliveryCosts[district]} грн.`, {
            reply_markup: {
                keyboard: [["Вартість доставки"],
            ["Години роботи кур'єрів"],
            ["Що є в меню?"],
            ["Оформити повернення"],
            ["Які способи оплати доступні"],
            ["Як я можу змінити своє замовлення?"],
            ["Чи є у вас знижки або акції?"],
            ["Що робити, якщо я отримав неправильне замовлення?"],
            ["Як отримати знижку на перше замовлення?"]],
                resize_keyboard: true
            }
        });
    }  
    if (orderReturnState.has(ctx.chat.id)) {
        const orderNumber = ctx.message.text;
        ctx.reply(`Замовлення ${orderNumber} було повернуто!`);
        orderReturnState.delete(ctx.chat.id); 
    }
    if(menu[dishes]) {
        ctx.reply(`Вартість страви ${dishes}: ${menu[dishes]} грн.`, {
            reply_markup: {
                keyboard: [["Вартість доставки"],
                ["Години роботи кур'єрів"],
                ["Що є в меню?"],
                ["Оформити повернення"],
                ["Які способи оплати доступні"],
                ["Як я можу змінити своє замовлення?"],
                ["Чи є у вас знижки або акції?"],
                ["Що робити, якщо я отримав неправильне замовлення?"],
                ["Як отримати знижку на перше замовлення?"]],
                resize_keyboard: true
            }
        });
    }
});


// Запуск бота
bot.launch({
    webhook: {
        domain: WEBHOOK_URL,
        port: process.env.PORT || 3000,
    },
});


